# -*- coding: utf-8 -*-
'''
Задание 5.2a

Всё, как в задании 5.2, но, если пользователь ввел адрес хоста, а не адрес сети,
надо преобразовать адрес хоста в адрес сети и вывести адрес сети и маску, как в задании 5.2.

Пример адреса сети (все биты хостовой части равны нулю):
* 10.0.1.0/24
* 190.1.0.0/16

Пример адреса хоста:
* 10.0.1.1/24 - хост из сети 10.0.1.0/24
* 10.0.5.1/30 - хост из сети 10.0.5.0/30

Если пользователь ввел адрес 10.0.1.1/24,
вывод должен быть таким:

Network:
10        0         1         0
00001010  00000000  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''

ip = input("Введите IP-адрес в формате 10.1.2.3/24: ")

ip1, ip2, ip3, ip4 = ip.split("/")[0].split(".")
ip1=int(ip1)
ip2=int(ip2)
ip3=int(ip3)
ip4=int(ip4)
mask = int(ip.split("/")[1])
bitip="{0:08b}{1:08b}{2:08b}{3:08b}".format(ip1,ip2,ip3,ip4)

bitnet=bitip[0:mask]+"0"*(32-mask)
bitmask = "1"*mask + "0"*(32-mask)

mask1 = int(bitmask[0:8], 2)
mask2 = int(bitmask[8:16], 2)
mask3 = int(bitmask[16:24], 2)
mask4 = int(bitmask[24:32], 2)

net1 = int(bitnet[0:8],2)
net2 = int(bitnet[8:16],2)
net3 = int(bitnet[16:24],2)
net4 = int(bitnet[24:32],2)

print("Network:\n")
print("{0:<10} {1:<10} {2:<10} {3:<10}\n{0:08b}   {1:08b}   {2:08b}   {3:08b}".format(
    net1, net2, net3, net4))
print("\nMask:\n/{}".format(mask))
print("{0:<10} {1:<10} {2:<10} {3:<10}\n{0:<08b}   {1:<08b}   {2:<08b}   {3:<08b}".format(
    mask1, mask2, mask3, mask4))
